# Git - распределенная система конторля версий. Это система для отслеживания и ведения истории изменения файлов, в вашем проекте
# Репозиторий - хранилище вашего кода и истории его изменений.
# GitHun - веб-сайт для размещения git- репрозиториев и совместной разработки проектов.
# Команды Git:
# git init - git init -> создание файла настройки 
# git add <filename> -> добавленеи файла 
# 2.1 git add. -> добавить все файлы в папке на загрузку
# 3 git commit -m '<message>' -> потверждение изменения файлов и окончательно готовит их к заргурзке
# git branch - Ветки очень важны в git При помощи веток несколько программистов могут работать паралельно на одном и том же проекте
# ПРи помощи команды git branch мы можем моздать, просматривать или удалять ветки 
#  git branch <branch name>  
# просмотр веток: git brranch or git branch --list
# Удаление- git branch -d <branch name> 
# git remote add <linmk name> <ssh link>- команда для связывания проекта с репрозиторием в github
# gir push origin <branch name> ->
# загрузить изменения совершенные в git commit на сайт
# для загрузки новых файлов повторить шаги 2,3,5
# 
# 
# 
# 
# 